app/controllers/news_controller.rb

SELECT * FROM `search_terms` WHERE (`search_terms`.search_id = 1) ORDER BY updated_at DESC LIMIT 2
SELECT * FROM `searches` WHERE (`searches`.`id` = 1)
---
  def search
    @recent_searches = @search.search_terms.find(:all,
                                               :limit => 10,
                                               :order => "updated_at DESC" )