app/controllers/search_controller.rb

  def create
    # store a search term
    if params[:q]
      search_text = params[:q]
      past_search = @search.search_terms.find_by_keywords(search_text)
      if past_search
        past_search.updated_at = DateTime.now
        past_search.save  # update timestamp
      else
        SearchTerm.create( :keywords => search_text, :search => @search)
---
SELECT * FROM `search_terms` WHERE (`search_terms`.`keywords` = 'paypal') AND (`search_terms`.search_id = 2) LIMIT 1
UPDATE `search_terms` SET `updated_at` = '2010-11-16 21:43:46' WHERE `id` = 43
INSERT INTO `search_terms` (`created_at`, `updated_at`, `search_id`, `keywords`) VALUES('2010-11-16 20:01:12', '2010-11-16 20:01:12', 2, 'paypal')